artilleryConfigs/DestroyServer.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 120
      arrivalRate: 25
      name: Warm-up
    - duration: 300
      arrivalRate: 100
      name: Ramping-up
    - duration: 600
      arrivalRate: 150
      rampTo: 2000
      name: Lets destroy server?
  processor: "./payload-generator/generateDataToPost.js"
  payload:
    path: "gameIds.csv"
    fields:
      - "gameId"
scenarios:
  - name: "Get ALL reviews of game with"
    flow:
      - get:
          url: "/api/gamereviews/{{ gameId }}"
  - name: "Get positive & negative reviews & playtime constraints"
    flow:
      - get:
          url: "/api/gamereviews/{{ gameId }}?review_type=positive"
      - get:
          url: "/api/gamereviews/{{ gameId }}?review_type=negative"
      - get:
          url: "/api/gamereviews/{{ gameId }}?review_type=negative&play_max=25"
      - get:
          url: "/api/gamereviews/{{ gameId }}?review_type=positive&play_max=100"
  - name: "Post a new review"
    flow:
      - function: "generateData"
      - post:
          url: "/api/create/{{ id_game }}"
          json:
            num_comments: "{{ num_comments }}"
            num_found_funny: "{{ num_found_funny}}"
            num_found_helpful: "{{ num_found_helpful }}"
            hours_at_review_time: "{{ hours_at_review_time }}"
            hours_on_record: "{{ hours_on_record }}"
            is_recommended: "{{ is_recommended }}"
            purchase_type: "{{ purchase_type }}"
            date_posted: "{{ date_posted }}"
            id_user: "{{ id_user }}"
            received_free: "{{ received_free }}"
            review_text: "{{ review_text }}"